# SetFlags Method (Int32) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ValueAtPointBase..::..SetFlags Method (Int32)
ValueAtPointBase Class See Also
---
Sets the flags associated to all measurements to the same value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public void SetFlags(
	int flags
)
```

Visual Basic
---
```text
Public Sub SetFlags ( _
	flags As Integer _
)
```

Visual C++
---
```text
public:
void SetFlags(
	int flags
)
```

# ### Parameters
flags
    Type: System..::..Int32 Value of flags, uniform for all measurements. Flags values are defined in the enumerated class ValueAtPointFlags and are combined into the int value.
# See Also
ValueAtPointBase Class
SetFlags Overload
Autodesk.Revit.DB Namespace